[
  {
    "name": "Antel",
    "time": "2022 - Actual",
    "logo": "/logo_ancel.svg",
    "text": "Microservicios Node.js manejando 3.5M transacciones diarias. Refactorización a gran escala redujo despliegues 40%, errores 99.9%. GitLab CI/CD con 85% cobertura de pruebas.",
    "largeText": [
      "Antel, la Administración Nacional de Telecomunicaciones, es una empresa estatal uruguaya responsable de brindar servicios de telecomunicaciones en Uruguay. Es el principal proveedor de servicios de telefonía fija y móvil, internet y televisión por cable del país. Fundada en 1974, Antel juega un papel clave en la infraestructura de comunicaciones en Uruguay, ofreciendo servicios tanto a nivel nacional como internacional.",
      "Mi crecimiento como desarrollador ha sido ayudado por dos ingenieros con muchos años de experiencia en Antel. Han proporcionado correcciones a mi código y recomendado cursos para mejorar mis habilidades."
    ],
    "workMethod": "El método de trabajo involucra una reunión semanal para coordinar proyectos y prioridades.",
    "projects": [
      {
        "title": "Página en NextJs",
        "text": "Un proyecto en Next.js desde cero con una base de datos SQLite, login, validaciones y un servicio de mensajería SMS."
      },
      {
        "title": "Node",
        "text": "Proyecto Node con autenticación y generación de códigos de seguridad."
      },
      {
        "title": "Java a Node",
        "text": "Migración de un proyecto de gestión de IP de Java a Node."
      },
      {
        "title": "Jest",
        "text": "Creación de Pruebas Unitarias en Jest"
      }
    ],
    "technologies": [
      { "name": "JavaScript", "logo": "/logo_javascript.png", "category": "language" },
      { "name": "React", "logo": "/logo_react.png", "category": "framework" },
      { "name": "NextJs", "logo": "/logo_next.png", "category": "framework" },
      { "name": "Node", "logo": "/logo_node.png", "category": "framework" }
    ]
  },
  {
    "name": "Upshow",
    "time": "2021 - 2022",
    "logo": "/logo_upshow.png",
    "text": "Construí dashboards React consumiendo APIs Node/Express. Integré GitHub y Jira para reportes de referencia cruzada en tiempo real. Soporte completo del ciclo de vida Agile/Scrum.",
    "largeText": [
      "Upshow es una empresa especializada en tecnología y plataformas interactivas diseñadas para mejorar el engagement e interacción en eventos en vivo y lugares públicos. Proporciona soluciones que permiten a establecimientos y organizadores mostrar contenido generado por usuarios en pantallas y monitores, creando una experiencia más atractiva para la audiencia y fomentando la participación en tiempo real.",
      "Mi crecimiento dentro de la empresa fue gracias a un equipo que me proporcionó retroalimentación, clases de inglés y cursos pagados de Udemy patrocinados por la empresa."
    ],
    "workMethod": "Se utiliza metodología Scrum basada en solicitudes de un gerente.",
    "projects": [
      {
        "title": "Funcionalidad React",
        "text": "Creación de pequeñas funcionalidades para proyectos React."
      },
      {
        "title": "Node, GitHub y Jira",
        "text": "Proyecto de integración de datos entre GitHub y Jira."
      },
      {
        "title": "Elasticsearch",
        "text": "Proyecto de automatización para análisis de datos en Elasticsearch."
      },
      {
        "title": "Mostrar estado de servicios",
        "text": "Proyecto que muestra el estado de nuestros servicios día a día y hora a hora."
      }
    ],
    "technologies": [
      { "name": "JavaScript", "logo": "/logo_javascript.png", "category": "language" },
      { "name": "React", "logo": "/logo_react.png", "category": "framework" },
      { "name": "Node", "logo": "/logo_node.png", "category": "framework" }
    ]
  },
  {
    "name": "Hacknoid",
    "time": "2018 - 2021",
    "logo": "/logo_hacknoid.png",
    "text": "Migré frontend de Zend PHP a React.js, mejorando tiempo de carga 60%. Estrategias de branching Git para releases. Optimicé consultas SQL, reduciendo respuesta 40%.",
    "largeText": [
      "Hacknoid es una empresa orientada a la ciberseguridad que tiene una aplicación de pentesting automatizado."
    ],
    "workMethod": "Reuniones ocasionales con el jefe.",
    "projects": [
      {
        "title": "Django, Python",
        "text": "Creación de backend con Django Python."
      },
      {
        "title": "Zend a React",
        "text": "Migración de frontend de Zend Framework a React."
      },
      {
        "title": "Pentesting automatizado",
        "text": "Creación de módulos para pentesting en Python."
      }
    ],
    "technologies": [
      { "name": "Python", "logo": "/logo_python.png", "category": "language" },
      { "name": "JavaScript", "logo": "/logo_javascript.png", "category": "language" },
      { "name": "React", "logo": "/logo_react.png", "category": "framework" },
      { "name": "Node", "logo": "/logo_node.png", "category": "framework" }
    ]
  },
  {
    "name": "Gestion total",
    "time": "2017 - 2018",
    "logo": "/logo_gestionTotal.png",
    "text": "Desarrollé módulos JavaScript personalizados para sistema ERP, adaptando flujos de trabajo a necesidades de clientes en diversas industrias. UI responsiva con HTML5/CSS3.",
    "largeText": [
      "Gestion total vende funcionalidades en un ERPNext que se enfoca en la gestión administrativa de empresas.",
      "Mi crecimiento vino de resolver los pequeños desafíos que surgían en el trabajo"
    ],
    "workMethod": "Encargos por clientes.",
    "projects": [],
    "technologies": [
      { "name": "Python", "logo": "/logo_python.png", "category": "language" },
      { "name": "JavaScript", "logo": "/logo_javascript.png", "category": "language" }
    ]
  }
]