[
    {
        "name": "Antel",
        "time": "2022 - Current",
        "logo": "/logo_ancel.png",
        "text": "I have grown in knowledge of test automation, managing large-scale systems, implementing error handling best practices, and developing solutions for large infrastructures.",
        "largeText": [
            "Antel, the National Administration of Telecommunications, is a Uruguayan state-owned company responsible for providing telecommunications services in Uruguay. It is the main provider of fixed and mobile telephone services, internet, and cable television in the country. Founded in 1974, Antel plays a key role in the communications infrastructure in Uruguay, offering services both at a national and international level.",
            "My growth as a developer has been aided by two engineers with many years of experience at Antel. They have provided corrections to my code and recommended courses to enhance my skills."
        ],
        "workMethod": "The working method involves a weekly meeting to coordinate projects and priorities.",
        "projects": [
            {
                "title" : "Page in NextJs",
                "text" : "A project in Next.js from scratch with an SQLite database, login, validations, and an SMS messaging service."
            },
            {
                "title" : "Node",
                "text" : "Node project with authentication and generation of security codes."
            },
            {
                "title" : "Java to Node",
                "text" : "Migration of an IP management project from Java to Node."
            },
            {
                "title" : "Jest",
                "text" : "Creating Unit Tests in Jest"
            }
        ],
        "technologies": [
            {
                "name": "JavaScript",
                "logo": "/logo_javascript.png"
            },
            {
                "name": "React",
                "logo": "/logo_react.png"
            },
            {
                "name": "NextJs",
                "logo": "/logo_next.png"
            },
            {
                "name": "Node",
                "logo": "/logo_node.png"
            }
        ]
    },
    {
        "name": "Upshow",
        "time": "2021 - 2022",
        "logo": "/logo_upshow.png",
        "text": "I gained valuable experience with React, Node, and the Scrum methodology. My role involved collecting data metrics from our customers, development teams, and the uptime of our services to provide a clear and comprehensive overview of the overall company's status. All of this was done operating on various databases including GraphQL and MySQL, and working with GitHub and Jira APIs.",
        "largeText": [
            "Upshow is a company specialized in technology and interactive platforms designed to enhance engagement and interaction at live events and public venues. It provides solutions that allow establishments and organizers to display user-generated content on screens and monitors, creating a more engaging experience for the audience and encouraging real-time participation.",
            "My growth within the company was thanks to a team that provided me with feedback, English classes, and paid Udemy courses sponsored by the company."
        ],
        "workMethod": "Scrum methodology is used based on requests from a manager.",
        "projects":[
            {
                "title": "React feature",
                "text": "Creation of small features for React projects."
            },
            {
                "title" : "Node, GitHub and Jira",
                "text": "Data integration project between GitHub and Jira."
            },
            {
                "title" : "Elasticsearch",
                "text" : "Automation project for data analysis in Elasticsearch."
            },
            {
                "title" : "Show services status",
                "text" : "Project that displays the status of our services day by day and hour by hour."
            }
        ],
        "technologies": [
            {
                "name": "JavaScript",
                "logo": "/logo_javascript.png"
            },
            {
                "name": "React",
                "logo": "/logo_react.png"
            },
            {
                "name": "Node",
                "logo": "/logo_node.png"
            }
        ]
    },
    {
        "name": "Hacknoid",
        "time": "2018 - 2021",
        "logo": "/logo_hacknoid.png",
        "text": "I gained knowledge of code structure, developed a backend with Django, carried out a large-scale migration of the frontend from Zend PHP to React, led a small team of juniors, developed small pentesting tools, and participated in pentesting projects.",
        "largeText" : [
            "Hacknoid is a cybersecurity-oriented company that has an automated pentesting application."
        ],
        "workMethod":"Occasional meetings with the boss.",
        "projects":[
            {
                "title": "Django, Python",
                "text" : "Creation of backend with Django Python."
            },
            {
                "title": "Zend to React",
                "text": "Migration of frontend from Zend Framework to React."
            },
            {
                "title": "Automated pentesting",
                "text": "Creation of modules for pentesting in Python."
            }
        ],
        "technologies": [
            {
                "name": "python",
                "logo": "/logo_python.png"
            },
            {
                "name": "JavaScript",
                "logo": "/logo_javascript.png"
            },
            {
                "name": "React",
                "logo": "/logo_react.png"
            },
            {
                "name": "Node",
                "logo": "/logo_node.png"
            }
        ]
    },
    {
        "name": "Gestion total",
        "time": "2017 - 2018",
        "logo": "/logo_gestionTotal.png",
        "text": "I developed several features in JavaScript and Python for an ERPnext system focused on business management.",
        "largeText" : [
            "Gestion total sells features on an ERPNext which is focused on the administrative management of companies.",
            "My growth came from solving the small challenges that arose at work"
        ],
        "workMethod":"Commissioned by clients.",
        "projects":[],
        "technologies": [
            {
                "name": "python",
                "logo": "/logo_python.png"
            },
            {
                "name": "JavaScript",
                "logo": "/logo_javascript.png"
            }
        ]
    }
]